// src/data.ts
import type { Scenario, Item, MapOption } from "./types";

export const items: Item[] = [
  {
    id: "i1",
    name: "ผ้าเช็ดหน้า",
    description:
      "ผ้าเช็คหน้าสีขาวทำจากผ้าราคาแพงที่เปรอะดินและคราาบเลือด มันถูกพบอยู่ที่บริเวณด้านหน้าของถนนทางเข้าแประภาคารที่ถูกตัดขาด\n\nมันมีชื่อย่อปักว่า M.L. ",
    mapArea: "001",
    imgUrl: "src\\assets\\item\\i1.png",
    isOnlyOne: true,
  },
  {
    id: "i2",
    name: "ขนนกหัวขวานหัวแดง ",
    description:
      "พื้นที่ป่ามากมาย แต่คุณกลับมองเห็นขนนกนี้โดดเด่นขึ้นมาทั้งที่มันอยู่ที่พื้น และอยากจะนำมันกลับบ้าน\n\nเอฟเฟกต์: คุณรู้สึกปลอดภัยแปลก ๆ เมื่อพกสิ่งนี้ไว้ ",
    mapArea: "001",
    imgUrl: "src\\assets\\item\\i2.png",
  },
  {
    id: "i3",
    name: "กระดูกสัตว์",
    description:
      "กระดูกสัตว์บางอย่างที่ไม่อาจบอกได้ว่าคือตัวอะไร แต่มีร่องรอยของการถูกกัดแทะ ลักษณะคล้ายกับฟันของมนุษย์",
    mapArea: "001",
    imgUrl: "src\\assets\\item\\i3.png",
  },
  {
    id: "i4",
    name: "รอยเท้าของเด็กหญิง",
    description:
      "รอยเท้าเปื้อนขนาดเล็กที่ดูแล้วน่าจะเป็นของเด็กผู้หญิง มันปรากฏอยู่บนเส้นทางของการไปที่ประภาคาร\n\nทำไมถึงเกิดขึ้นได้ล่ะ ทั้งที่เส้นทางการไปประภาคารมันโดนตัดขาดแท้ๆ ",
    mapArea: "001",
    imgUrl: "src\\assets\\item\\i4.png",
    isOnlyOne: true,
  },
  {
    id: "i5",
    name: "โมเดลเรือขวด",
    description:
      "เรือจำลองลำเล็กที่ถูกบรรจุอยู่ในขวดแก้วขุ่น ทุกครั้งที่เปิดขวดจะเหมือนได้ยินเสียงทะเลดังแผ่วออกมา",
    mapArea: "001",
    imgUrl: "src\\assets\\item\\i5.png",
  },
  {
    id: "i6",
    name: "ภาพถ่ายโพลารอยด์",
    description:
      "เป็นภาพทีมค้นหาของคุณจากด้านหลัง…ทั้งที่นี่เป็นครั้งแรกที่คุณมา ใครหรืออะไรกำลังมองคนอยู่\n\nเอฟเฟกต์: หลังจากนี้จะมีภาพดพลาลอยด์ของคุณถูกส่งไปที่บ้านของคุณเป็นรูปแอบถ่ายในช่วงเวลาต่าง ๆ 2 ภาพ",
    mapArea: "001",
    imgUrl: "src\\assets\\item\\i6.png",
  },
  {
    id: "i7",
    name: "ขวดแก้วที่มีฟันอยู่ข้างใน",
    description:
      "ขวดแก้วแปลก ๆ ที่มีฟันของมนุษย์อยู่ข้างใน เหมือนจะยังมีเลือดติดออยู่.",
    mapArea: "001",
    imgUrl: "src\\assets\\item\\i7.png",
  },
  {
    id: "i8",
    name: "เศษกระจก",
    description:
      "เศษกระจกที่แตกเป็นชิ้นเล็กชิ้นน้อย มีรอยเลือดติดอยู่ที่ขอบของมัน",
    mapArea: "001",
    imgUrl: "src\\assets\\item\\i8.png",
  },
  {
    id: "i9",
    name: "ที่คาดผม",
    description:
      "ที่คาดผมสีแดง ของแบรนด์เนมยอดฮิตที่เป็นที่นิยมของเด็กหญิงในขณะนี้ มันถูกพบอยู่ที่ป่าข้างๆ เรือนจำ มันอาจจะเป็นของเด็กหญิงที่หายตัวไป",
    mapArea: "001",
    imgUrl: "src\\assets\\item\\i9.png",
    isOnlyOne: true,
  },
  {
    id: "i10",
    name: "ผ้าเช็ดหน้า",
    description:
      "ผ้าเช็คหน้าสีขาวทำจากผ้าราคาแพงที่เปรอะดินและคราาบเลือด มันถูกพบอยู่ที่บริเวณด้านหน้าของถนนทางเข้าแประภาคารที่ถูกตัดขาด\n\nมันมีชื่อย่อปักว่า M.L. ",
    mapArea: "002",
    imgUrl: "src\\assets\\item\\i10.png",
    isOnlyOne: true,
  },
  {
    id: "i11",
    name: "แผ่น CD ปริศนา",
    description:
      'ในแผ่น CD จะเริ่มเล่นภาพของชายแก่ที่กำลัง\n\nตะโกนอย่างเสียงดังในเรือนจำ\n\n\“มันกลับมา\”\n\n\“มันกลับมาแล้ว!!!\”\n\n\“เหมือน 27 ปีก่อน! พวกเราจะตายห่ากันหมด!\”\n\n\“เอาฉันออกไปจากที่นี่ ฉันจะต้องไปหา Woodpecker\”\n\n \“ฉันยังไม่อยากตาย!!"\n\nจากนั้น วิดีโอก็ถูกตัดออกไป',
    mapArea: "002",
    imgUrl: "src\\assets\\item\\i11.png",
    isOnlyOne: true,
  },
  {
    id: "i12",
    name: "ที่คาดผม",
    description:
      "ที่คาดผมสีแดง ของแบรนด์เนมยอดฮิตที่เป็นที่นิยมของเด็กหญิงในขณะนี้ มันถูกพบอยู่ที่ป่าข้างๆ เรือนจำ มันอาจจะเป็นของเด็กหญิงที่หายตัวไป",
    mapArea: "002",
    imgUrl: "src\\assets\\item\\i12.png",
    isOnlyOne: true,
  },
  {
    id: "i13",
    name: "เปลือกไม้ที่มีรอยขีดข่วนแปลกๆ",
    description:
      "สัญลักษณ์ประหลาดบางอย่างที่ดูชัดเจนว่าไม่ได้เกิดขึ้นเองจากสัตว์ป่า แต่น่าจะมีบางสิ่งเป็นผู้สร้างขึ้นมา โดยมันดูเหมือนถูกประกอบจากขนและกระดูกสัตว์อย่างตั้งใจ",
    mapArea: "002",
    imgUrl: "src\\assets\\item\\i13.png",
  },
  {
    id: "i14",
    name: "เขากวางที่บิดงอผิดรูป",
    description:
      "เขากวางที่งอกบิดไปมาอย่างผิดปกติจนน่าสงสัยว่ากวางเจ้าของเขาจะหน้าตาอย่างไร\n\nเอฟเฟกต์: รู้สึกเหมือนเห็นกวางรูปร่างบิดเบี้ยวอยู่ภายในป่าเรื่อย ๆ จนกว่าคุณจะออกจากป่า",
    mapArea: "002",
    imgUrl: "src\\assets\\item\\i14.png",
  },
  {
    id: "i15",
    name: "รองเท้าบูทยางข้างเดียว",
    description:
      "รองเท้าบูทข้างหนึ่งที่ใหญ่กว่าขนาดเท้าคุณสองเบอร์ และมีลูกสนและเศษถั่วอยู่ด้านในเต็มไปหมด\n\nเอฟเฟกต์: หลังจากวันนี้ คุณจะถูกเหล่ากระรอกภายในเมืองจ้องมองเพราะไปยุ่งกับอาหารของพวกมัน",
    mapArea: "002",
    imgUrl: "src\\assets\\item\\i15.png",
  },
  {
    id: "i16",
    name: "ซากโทเทม",
    description:
      "ซากโทเทมเก่าที่ตั้งกระจัดกระจายอยู่ในป่า ดูเหมือนว่ามันจะเป็นของชนเผ่าพื้นเมืองที่เคยอาศัยอยู่ในพื้นที่นี่มาก่อน",
    mapArea: "002",
    imgUrl: "src\\assets\\item\\i16.png",
  },
  {
    id: "i17",
    name: "เครื่องหมายสัญลักษณ์ประหลาด",
    description:
      "สัญลักษณ์ประหลาดบางอย่างที่ดูชัดเจนว่าไม่ได้เกิดขึ้นเองจากสัตว์ป่า แต่น่าจะมีบางสิ่งเป็นผู้สร้างขึ้นมา โดยมันดูเหมือนถูกประกอบจากขนและกระดูกสัตว์อย่างตั้งใจ ",
    mapArea: "002",
    imgUrl: "src\\assets\\item\\i17.png",
  },
  {
    id: "i18",
    name: "เศษป้ายผ้าปักหมายเลข 8350 ",
    description:
      "ป้ายผ้าที่ปักหมายเลข 8350 ที่ถูกฉีกออกมาจากเสื้อสีส้ม มันเลอะโคลนไปหมด คุณได้แต่หวังว่ามันคงไม่ใช่ป้ายของนักโทษ",
    mapArea: "002",
    imgUrl: "src\\assets\\item\\i18.png",
    isOnlyOne: true,
  },
  {
    id: "i19",
    name: "ไดอารี่ที่มีหน้าที่ถูกฉีกออก",
    description:
      "ไดอารี่ของเด็กหญิง ถูกพบในล็อคเกอร์ที่โรงเรียน หากคุณลองเปิดดูจะพบว่ามันมีบันทึกประจำวันที่เด็กหญิงเขียนไว้ หน้าสุดท้ายที่มีข้อความเขียนว่า\n\nMarch 16\n\nเจ้าเหมียวที่แสนน่ารักของฉัน อลิซ มันหายตัวไปในป่า พวกเราพยายามตามหามันแล้วก็ยังไม่พบ\n\nฉันคิดถึงมันเหลือเกิน ยิ่งข้างนอกนั่นมีตัวอะไรก้ไม่รู้ฆ่าสัตว์ป่าอีก\n\nหวังว่ามันจะไม่เป็นไรนะ :(\n\nและหน้าถัดไปมันถูกฉีกออก",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i19.png",
    isOnlyOne: true,
  },
  {
    id: "i20",
    name: "หน้ากระดาษที่มีรอยฉีกตรงกับไดอารี่ของเด็กสาว ชิ้นที่ 1",
    description:
      "หน้ากระดาษที่มีรอยฉีกตรงกับไดอารี่ของเด็กสาว ดูเหมืออนว่ามันต้องการอีกสองชิ้นเพื่อที่จะประกอบกันอย่างสมบูรณ์",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i20.png",
    isOnlyOne: true,
  },
  {
    id: "i21",
    name: "หน้ากระดาษที่มีรอยฉีกตรงกับไดอารี่ของเด็กสาว ชิ้นที่ 2",
    description:
      "หน้ากระดาษที่มีรอยฉีกตรงกับไดอารี่ของเด็กสาว ดูเหมืออนว่ามันต้องการอีกสองชิ้นเพื่อที่จะประกอบกันอย่างสมบูรณ์",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i21.png",
    isOnlyOne: true,
  },
  {
    id: "i22",
    name: "หน้ากระดาษที่มีรอยฉีกตรงกับไดอารี่ของเด็กสาว ชิ้นที่ 3",
    description:
      "หน้ากระดาษที่มีรอยฉีกตรงกับไดอารี่ของเด็กสาว ดูเหมืออนว่ามันต้องการอีกสองชิ้นเพื่อที่จะประกอบกันอย่างสมบูรณ์",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i22.png",
    isOnlyOne: true,
  },
  {
    id: "i23",
    name: "ช้อนพลาสติกที่ถูกงอ",
    description:
      "ช้อนราคาถูกที่งอแบบไม่รู้สาเหตุ เหมือนมีใครพยายามดัดมันด้วยพลังจิต(?)\n\nเอฟเฟกต์: ไม่มีประโยชน์ใด ๆ แต่คุณรู้สึกอยากจะลองงอช้อนด้วยพลังจิตบ้าง",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i23.png",
  },
  {
    id: "i24",
    name: "คูปองลดราคา 10% จากร้านค้าในเมือง",
    description:
      "คูปองลดราคาที่ถูกเขียนด้วยมาร์กเกอร์โง่ๆ ลองไปยื่นกับร้านค้าซักร้านดูสิ อาจจะได้รับส่วนลดจริงๆก็ได้",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i24.png",
  },
  {
    id: "i25",
    name: "กล่องถุงยางเปล่า",
    description:
      "กล่องถุงยางเปล่ามีข้อความข้างกล่องเขียนว่า \n\n\“ถ้ามีเซ็กส์ เธอจะตาย\” \n\nแต่ดูเหมือนว่าไม่มีใครเชื่อข้อความนี้เลย",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i25.png",
  },
  {
    id: "i26",
    name: "ถุงขนมโดริโทส",
    description:
      "ถุงขนมยับยู่ยี่ที่ดูเหมือนเพิ่งถูกเปิดไม่นาน ภายในยังเหลือเศษผงสีส้มติดอยู่ก้นถุง",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i26.png",
  },
  {
    id: "i27",
    name: "แผ่นเพลง Queen of Pop (Madonna)",
    description:
      "แผ่น CD เก่าที่มีรอยขีดข่วนจำนวนมาก เมื่อเปิดฟัง เพลงจะเล่นไม่ครบ และมีเสียงสวดบางอย่างแทรกขึ้นมา\n\nเอฟเฟกต์: หลังจากเปิดฟัง ตอนเช้าคุณจะตื่นขึ้นมาในสภาพแก้ผ้าในท่าทางเหมือนสวดอ้อนวอนบางอย่างที่มุมหนึ่งของห้อง",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i27.png",
  },
  {
    id: "i28",
    name: "นิตยสาร Runway",
    description:
      "นิตยสารแฟชั่นที่เปียกชื้น หน้าปกเป็นนางแบบในชุดสีแดงที่ไม่เห็นใบหน้าเพราะหมึกละลาย หน้ากลางเล่มถูกพับเปิดค้างไว้ที่หน้าบทสัมภาษณ์ \“การหายตัวไปของดาวจรัสฟ้า\” ",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i28.png",
  },
  {
    id: "i29",
    name: "หน้ากระดาษที่มีรอยฉีกตรงกับไดอารี่ของเด็กสาว (ประกอบกันได้)",
    description: "",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i29.png",
    isOnlyOne: true,
    isLocked: true, // ไอเทมนี้จะถูกล็อกไว้จนกว่าจะได้ไอเทมที่มีรอยฉีกครบทั้ง 3 ชิ้น
  },
  {
    id: "i30",
    name: "นิตติ้งสีชมพู",
    description:
      "เน็ตติ้งสีชมพูที่ยังถักไม่เสร็จ เหมือนมันจะไม่ได้ถักจากเส้นไหมพรมอย่างเดียว. แต่มีเส้นผมปนอยู่ด้วย.",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i30.png",
  },
  {
    id: "i31",
    name: "แผงยาคุม",
    description: "แผงยาคุมที่ถูกกินไปแล้ว 2 เม็ด อา.วัยรุ่น",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i31.png",
  },
  {
    id: "i32",
    name: "แว่นตานิรภัยกันสารเคมี",
    description: "ถ้าใส่แล้ว อยากจะพูดออกมาดังๆ ว่า ยูเรก้า!!!",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i32.png",
  },
  {
    id: "i33",
    name: "นิตยสารปลุกใจเสือป่า",
    description:
      "นิตยสารวาบหวิวของใครบางคนที่ถูกซุกเอาไว้ ตอนนี้มันเป็นของคุณแล้ว อย่าให้โดนจับได้ล่ะว่าคุณอ่านมัน",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i33.png",
  },
  {
    id: "i34",
    name: "บัตรเติมเงินตู้โทรศัพท์",
    description:
      "บัตรเติมเงินใหม่เอี่ยมที่ยังไม่ถูกใช้ ลองใช้มันโทรหาคนที่คุณคิดถึงสิ ",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i34.png",
  },
  {
    id: "i35",
    name: "โปสเตอร์หนังดังในปีหนัง",
    description:
      "โปสเตอร์หนังที่กำลังจะฉายในปีนี้ \n\nน่าเสียดายที่เมืองนี้ไม่มีโรงหนัง \n\nหนังพวกนี้น่าสนใจมาก! จนต้องถ่อไปเมืองข้างๆ เพื่อดูมัน ",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i35.png",
  },
  {
    id: "i36",
    name: "เทปคาสเซ็ตเก่า ๆ ที่มีป้ายแปะเขียนไว้ว่า ‘My Dear’",
    description:
      "เทปคาสเซ็ตสีแดงเก่า\n\nเมื่อเปิดฟัง จะได้ยินเพียงเสียงฮัมเพลงอู้อี้ปะปนกับเสียงคลื่นซัดอยู่ครู่หนึ่ง ก่อนที่เสียงผู้หญิงแผ่วเบาจะกระซิบขึ้นว่า\n\n\“อย่าบอกพวกเขาว่าคุณเห็นฉัน\”\n\nจากนั้นเทปก็จบลงทันที\n\nเอฟเฟกต์: หลังจากฟังเทป คุณจะเริ่มเห็นหญิงสาวในชุดสีแดงปรากฏอยู่ที่หางตาตลอดเวลา เป็นระยะเวลา 3 วัน",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i36.png",
  },
  {
    id: "i37",
    name: "ไดอารี่สุดหวานแววขของเด็กนักเรียนหญิงคนหนึ่งที่ถูกพบในล็อคเกอร์ของโรงเรียน",
    description:
      "ไดอารี่ที่ถูกพบในล็อคเกอร์ของโรงเรียน มันเต็มไปด้วยบันทึกประจำวันที่เด็กนักเรียนหญิงคนหนึ่งเขียนไว้เกี่ยวกับชีวิตประจำวันของเธอ ความคิด ความรู้สึก และความหวังของเธอในอนาคต\n\nเอฟเฟกต์: เมื่ออ่านไดอารี่ คุณจะมีเพลง ...Baby One More Time ของ Britney Spears เล่นอยู่ในหัวเป็นระยะเวลา 3 ชม.",
    mapArea: "003",
    imgUrl: "src\\assets\\item\\i37.png",
  },
];

export const scenarios: Scenario[] = [
  {
    id: "s1",
    description:
      "คุณเดินหลงป่าอยู่สักประมาณ 30 นาที แล้วคุณก็เดินจนออกจากป่ากลับมาที่จุดเริ่มต้นแบบงงๆ พร้อมกับมีบางอย่างติดตมือของคุณมาด้วย โดยที่คุณจำไม่ได้ว่าไปหยิบมันมาตั้งแต่เมื่อไร",
    mapArea: ["001", "002"],
  },
  {
    id: "s2",
    description:
      "เมื่อคุณตะโกนเรียกชื่อของเด็กที่หายไป จะมีเสียงเด็กหญิงตอบกลับว่า “อยู่ตรงนี้” จากคนละทิศพร้อมกันหลายเสียงแทรกเข้ามา เหมือนคลื่นซ่าวิทยุ",
    mapArea: ["001", "002"],
  },
  {
    id: "s3",
    description:
      "ระหว่างที่คุณกำลังเดินสำรวจพื้นที่อยู่กับเพื่อนๆ ทุกคนเริ่มได้ยินเสียงเพื่อนคนหนึ่งในทีมพูด ทั้งที่เจ้าตัวไม่ได้อ้าปาก",
    mapArea: ["001", "002", "003"],
  },
  {
    id: "s4",
    description:
      "คุณเห็นเงาของสิ่งมีชีวิตบางอย่างที่ยืนอยู่ระหว่างต้นไม้อยู่ตลอดเวลา แต่พอคุณพยายามจะเข้าไปหา มันก็จะหายไปทันทีที่คุณเข้าใกล้",
    mapArea: ["001", "002"],
  },
  {
    id: "s5",
    description:
      "ระหว่างคุณกำลังสำรวจพื้นที่อยู่นั้น ก็ได้ยินเสียงหัวเราะของเด็กหญิงดังแว่วๆ อยู่ใกล้ๆ ทั้งที่ไม่มีใครอยู่ใกล้ๆ คุณเลยสักคน",
    mapArea: ["001", "002", "003"],
  },
  {
    id: "s6",
    description:
      "คุณได้เห็นเงาวูบไหวอยู่แถวกระจกห้องเรียน เมื่อมองเข้าไปใกล้จึงพบกับรอยมือจำนวนมากบนกระจก",
    mapArea: ["003"],
  },
  {
    id: "s7",
    description:
      "เมื่อก้าวเท้าเข้าเขตโรงเรียน มีเสียงตกของกระถางดังแว่วมาจากทางขวาของคุณ เมื่อเข้าไปสำรวจ คุณจะพบกับซากกระถาง และ เศษเส้นผมสีบลอนด์จำนวนมากที่ปนกับดิน",
    mapArea: ["003"],
  },
  {
    id: "s8",
    description:
      "มีเสียงฝีเท้าดังก้องกระทบกับพื้นโถงทางเดิน คุณได้วิ่งตามไปยังต้นตอของเสียงนั้น และพบกับชุดมาสคอตทีมเบสบอลประจำโรงเรียนที่เหมือนกับมีใครสักคนรีบถอดมันทิ้งไว้ที่จุดนี้",
    mapArea: ["003"],
  },
  {
    id: "s9",
    description:
      "ระหว่างการสำรวจ จู่ๆสายลมหวีดหวิวนั้นฟังดูคล้ายเสียงโหยหวนของมนุษย์ดังก้องอยู่รอบๆ ตัวของคุณ\nคุณจึงรีบวิ่งหนี ก่อนชนเข้ากับบางอย่างแรงจนทำให้คุณล้มลงไปกองกับพื้น",
    mapArea: ["002"],
  },
  {
    id: "s10",
    description:
      "เมื่อเดินไปใกล้ต้นไม้ต้นที่มีรอยข่วนยาว พลันจู่ๆซากนกและกิ่งไม้ก็ร่วงลงมากองเบื้องหน้าโดยไม่ทันตั้งตัว โดยในนั้นเองก็มีบางสิ่งตกลงมาใส่หัวของคุณ",
    mapArea: ["001", "002"],
  },
  {
    id: "s11",
    description:
      "คุณสังเกตเห็นร่องรอยรองเท้าของเด็กหญิงที่หายไป เป็นรอยเท้าเปล่าข้างหนึ่งกับอีกข้างหนึ่งใส่รองเท้า พอคุณเดินตามไปเรื่อย ๆ จนพบว่า “รอยเท้าของเด็กหญิง” ขาขวาของเธอหายไป มีเพียงแค่รอยเท้าของข้างซ้ายเท่านั้น...",
    mapArea: ["001"],
  },
  {
    id: "s12",
    description:
      "ในระหว่างที่คุณกำลังพยายามหาทางเดินข้ามไปที่ประภาคารร้างนั้น จู่ๆ คุณก็ได้ยินเสียงบางสิ่งที่ถูกโยนลงไปน้ำซ้ำๆ อย่างรุนแรง แต่พอคุณมองไปยังแหล่งที่มาของเสียงนั้น คุณกลับไม่เห็นอะไรเลยนอกจากกระเพื่อมของน้ำ",
    mapArea: ["001"],
  },
  {
    id: "s13",
    description:
      "ระหว่างที่คุณกำลังเดินสำรวจในพื้นที่ป่านั้น คุณพบกับนกหัวขวาน (Red-headed Woodpecker) พอมันเห็นคุณ มันก็ร้องเสียงดังใส่จนทำให้เขารู้สึกแสบแก้วหู จากนั้นมันก็บินจากไป",
    mapArea: ["001", "002"],
  },
];

export const positionOptions = [
  { id: "p1", name: "นักเรียน" },
  { id: "p2", name: "ชาวเมือง" },
];

export const mapOptions: MapOption[] = [
  {
    id: "001",
    name: "พื้นที่ 1",
    description: "ประภาคารร้าง",
  },
  {
    id: "002",
    name: "พื้นที่ 2",
    description: "ป่ารอบๆ เรือนจำ",
  },
  {
    id: "003",
    name: "พื้นที่ 3",
    description: "โรงเรียน Murrwood High",
  },
];
